'use strict';

/*
---------------TASK-6---------------
6**.(Это задание не является частью курса, можете его не делать, 
оно для тех кому мало обычных заданий, требует времени и 
возможно гугления, делайте по желанию.) Программа должна спросить 
у пользователя число, это будет количество денег, которое он хочет
положить на счет в банке. Затем программа должна выдать примерно 
такое сообщение:
"Ваша сумма в 101 рубль успешно зачислена." - в случае если 
пользователь ввел 101
"Ваша сумма в 10020 рублей успешно зачислена." - в случае если 
пользователь ввел 10020
"Ваша сумма в 120104 рубля успешно зачислена." - в случае если 
пользователь ввел 120104
То есть ваша задача выводить слово «рубль» в правильном падеже, 
в зависимости от введенного числа.
*/

let deposit = prompt('Введите сумму для Вашего депозита.');
let len = deposit.charAt(deposit.length-1);

if(len == 2 || len == 3 || len == 4) {
	alert(`Ваша сумма в ${deposit} рубля успешно зачислена на счёт.`);
}
else if(len == 1) {
	alert(`Ваша сумма в ${deposit} рубль успешно зачислена на счёт.`);
}
else {
	alert(`Ваша сумма в ${deposit} рублей успешно зачислена на счёт.`);
}
